Repository: dotnet/ResXResourceManager
Catalog: src/ResXManager.Model/Properties/Resources.*.resx
Languages: de, zh_hans

# DuplicateKeyError
source: Duplicate keys in '{0}': {1}
de: Doppelte Schlüssel in '{0}': {1}
zh_hans: “{0}”中的重复键： {1}

# DuplicateKeyHandling_Fail
source: Show an error message and don't load the resource
de: Eine Fehlermeldung anzeigen und die Datei nicht laden
zh_hans: 显示错误消息，不加载该资源

# DuplicateKeyHandling_Rename
source: Postfix duplicate/empty keys with "_Duplicate[#]"/"_Empty[#]"
de: Doppelte/leere Schlüssel umbenennen ("_Duplicate[#]"/"_Empty[#]" anhängen)
zh_hans: 在重复或空的资源前增加 "_Duplicate[#]"/"_Empty[#]" 后缀

# EmptyKeysError
source: Empty keys in '{0}'
de: Leere Schlüssel in '{0}'
zh_hans: “{0}”中的空键

# ExcelExport_MultipleSheets
source: Multiple sheets
de: In mehrere Arbeitsblätter
zh_hans: 多工作表

# ExcelExport_SingleSheet
source: Single sheet
de: In ein einziges Arbeitsblatt
zh_hans: 单工作表

# FileSaveError
source: Error saving file '{0}': {1}
de: Fehler beim Speichern der Datei '{0}': {1}
zh_hans: 保存文件“{0}”时出错： {1}

# ImportColumnMismatchError
source: At least three columns expected.
de: Mindestens drei Spalten erwartet.
zh_hans: 预期至少三个列。

# ImportDuplicateLanguageError
source: Duplicate language in header.
de: Doppelte Sprache gefunden.
zh_hans: 标头 {0} 和 {1}（“{2}”）中的语言重复。

# ImportFailedError
source: Import failed. Nothing has been imported.
de: Import fehlgeschlagen. Es wurde nichts importiert.
zh_hans: 导入失败，没有内容被导入。

# ImportFailedPartiallyError
source: Import failed partially. Some columns have been already imported, but not all.
de: Import teilweise fehlgeschlagen. Einige Spalten wurden überschrieben, aber nicht alle.
zh_hans: 导入部分失败，仅部分列被导入。

# ImportHeaderMismatchError
source: Standard header expected.
de: Kopfzeile entspricht nicht dem Standard.
zh_hans: 预期的标准头。

# ImportLanguageNotEditable
source: The language "{0}" can't be edited. The operation was aborted.
de: Die Sprache "{0}" kann nicht bearbeitet werden. Der Vorgang wurde abgebrochen.
zh_hans: 不能编辑语言"{0}"。已中止操作。

# ImportMapSheetError
source: The sheet "{0}" can't be imported; there is no matching resource file in the solution.
de: Das Arbeitsblatt "{0}" kann nicht importiert werden; es gibt keine passende Ressource in der Umgebung.
zh_hans: 表"{0}"不能导入;在解决方案中没有匹配的资源文件。

# InvalidResourceFileError
source: {0} is not a valid RESX resource file: No xml root.
de: {0} ist keine gültige Ressourcedatei: Kein xml root.
zh_hans: {0} 不是有效的 RESX 资源文件︰没有 xml 根。

# InvalidResourceFileNameAttributeMissingError
source: {0} is not a valid RESX resource file: Not all entries have a name attribute.
de: {0} ist keine gültige Ressourcedatei: Nicht alle Einträge haben ein 'name' - Attribute.
zh_hans: {0} 不是有效的 RESX 资源文件︰并不是所有的条目具有名称属性。

# InvalidResourceFileValueAttributeMissingError
source: {0} is not a valid RESX resource file: Not all entries have a value attribute.
de: {0} ist keine gültige Ressourcedatei: Nicht alle Einträge haben ein 'value' - Attribute.
zh_hans: {0} 不是有效的 RESX 资源文件：并非所有条目都具有值属性。

# LanguageNotDefinedError
source: Language is not defined: "{0}".
de: Die Sprache "{0}" ist nicht definiert.
zh_hans: 未定义语言："{0}"。

source: Neutral
zh_hans: 中立

# SnapshotAnnotation
source: Snapshot: "{0}"
zh_hans: 快照：“{0}”

# ResourceTableEntry_Error_StringFormatParameterMismatch
source: Warning: This item contains string format parameter mismatches!
de: Warnung: Dieser Text enthält String-Format Parameterinkonsistenzen!
zh_hans: 警告︰ 此项目包含字符串格式参数不匹配！

# NotAllLanguagesAreEditable
source: Not all resource files are editable
de: Nicht alle Ressourcendateien sind editierbar
zh_hans: 某些资源文件是只读的

# KeyAlreadyExists
source: This key already exists: {0}
de: Der Schlüssel existiert bereits: {0}
zh_hans: 名称 {0} 已经存在

# ResourceTableEntry_Error_MissingTranslation
source: Missing translation
de: Fehlende Übersetzung
zh_hans: 缺少翻译

# ResourceTableEntry_Error_InvariantWithValue
source: Item is invariant but contains a value
de: Invarianter Eintrag enthält Übersetzung
zh_hans: 项目无效但包含值

# ExcelExport_PlainTextTabDelimited
source: Plain text, tab delimited
de: Nur Text, Tabulator getrennt
zh_hans: 纯文本，制表符分隔

# ResourceTableEntryRuleStringFormat_Name
source: Matching string format parameters
de: Passende String Format Parameter
zh_hans: 匹配字符串格式参数

# ResourceTableEntryRulePunctuationLead_Name
source: Leading punctuation
de: Zeichensetzung am Anfang
zh_hans: 首标点

# ResourceTableEntryRuleStringFormat_Description
source: This rule verifies that the string format parameters match in all translations of a item.
de: Diese Regel überprüft ob alle Übersetzungen die gleichen Parameter für String Format enthalten.
zh_hans: 此规则验证字符串格式参数在项目的所有翻译中是否匹配。

# ResourceTableEntryRulePunctuationLead_Description
source: This rule verifies that the punctuation of the entry matches between all translations.
de: Diese Regel überprüft ob die Zeichensetzung am Anfang des Eintrages in jeder Übersetzung gleich ist.
zh_hans: 此规则验证条目的标点在所有翻译之间都匹配。

# ResourceTableEntryRulePunctuationTail_Description
source: This rule verifies the punctuation at the end of the message.
de: Diese Regel überprüft ob die Zeichensetzung am Ende des Eintrages in jeder Übersetzung gleich ist.
zh_hans: 此规则验证条目末尾的标点符号。

# ResourceTableEntryRulePunctuationTail_Name
source: Trailing punctuation
de: Zeichensetzung am Ende
zh_hans: 尾标点

# ResourceTableEntryRuleWhiteSpaceLead_Name
source: Leading whitespace
de: Leerzeichen am Anfang
zh_hans: 起始空白

# ResourceTableEntryRuleWhiteSpaceLead_Description
source: This rule verifies that the whitespaces at the start of the messages match.
de: Diese Regel überprüft ob die Leerzeichen am Anfang des Eintrages in jeder Übersetzung gleich ist.
zh_hans: 此规则验证条目开头的空白是否匹配。

# ResourceTableEntryRuleWhiteSpaceLead_Error_Intro
source: The whitespaces at the start of the sequence don't match up.
de: Die Leerzeichen am Anfang des Eintrages stimmen nicht überein.
zh_hans: 序列开头的空白不匹配。

# ResourceTableEntryRuleWhiteSpaceLead_Error_NoWhiteSpaceExpected
source: No whitespaces are expected at the start of the sequence.
de: Am Anfang des Eintrages wurden keine Leerzeichen erwartet.
zh_hans: 在序列开始处不应有空白。

# ResourceTableEntryRuleWhiteSpaceLead_Error_WhiteSpaceSeqExpected
source: The expected whitespace sequence is: {0}
de: Die erwartete Folge von Leerzeichen ist: {0}
zh_hans: 预期的空白序列为：{0}

# ResourceTableEntryRuleWhiteSpaceTail_Name
source: Trailing whitespace
de: Leerzeichen am Ende
zh_hans: 尾空白

# ResourceTableEntryRuleWhiteSpaceTail_Description
source: This rule verifies that the trailing whitespaces of the messages match.
de: Diese Regel überprüft ob die Leerzeichen am Ende des Eintrages in jeder Übersetzung gleich ist.
zh_hans: 此规则验证条目的尾空白是否匹配。

# ResourceTableEntryRuleWhiteSpaceTail_Error_Intro
source: The whitespaces at the end of the sequence don't match up.
de: Die Leerzeichen am Ende des Eintrages stimmen nicht überein.
zh_hans: 序列末尾的空白不匹配。

# ResourceTableEntryRuleWhiteSpaceTail_Error_NoWhiteSpaceExpected
source: No whitespaces are expected at the end of the sequence.
de: Am Ende des Eintrages wurden keine Leerzeichen erwartet.
zh_hans: 序列末尾不应有空白。

# ResourceTableEntryRuleWhiteSpaceTail_Error_WhiteSpaceSeqExpected
source: The expected whitespace sequence is: {0}
de: Die erwartete Folge von Leerzeichen ist: {0}
zh_hans: 预期的空白序列为：{0}

# ResourceTableEntryRulePunctuationLead_Error_Intro
source: The punctuation at the start of the messages doesn't match up.
de: Die Zeichensetzung am Anfang des Eintrages stimmen nicht überein.
zh_hans: 条目开头的标点符号不匹配。

# ResourceTableEntryRulePunctuationLead_Error_NoPunctuationExpected
source: No punctuation was expected at the start of the message.
de: Am Anfang des Eintrages wurden keine Satzzeichen erwartet.
zh_hans: 条目开头不应出现标点符号。

# ResourceTableEntryRulePunctuationLead_Error_PunctuationSeqExpected
source: The expected leading punctuation sequence is: {0}
de: Der erwartete Folge von Satzzeichen ist: {0}
zh_hans: 预期的首标点序列为：{0}

# ResourceTableEntryRulePunctuationTail_Error_Intro
source: The punctuation at the end of the messages doesn't match up.
de: Die Zeichensetzung am Ende des Eintrages stimmen nicht überein.
zh_hans: 条目末尾的标点符号不匹配。

# ResourceTableEntryRulePunctuationTail_Error_NoPunctuationExpected
source: No punctuation was expected at the end of the message.
de: Am Ende des Eintrages wurden keine Satzzeichen erwartet.
zh_hans: 条目末尾不应出现标点符号。

# ResourceTableEntryRulePunctuationTail_Error_PunctuationSeqExpected
source: The expected trailing punctuation sequence is: {0}
de: Der erwartete Folge von Satzzeichen ist: {0}
zh_hans: 预期的尾标点序列为：{0}
