Repository: dotnet/ResXResourceManager
Catalog: ResXManager.View/Properties/Resources.*.resx
Languages: de

# AddEntryToWinFormsResourceWarning
source: You are about to add new entries to a WinForms designer resource. Additional entries will be lost if you edit the form. Do you want to add a new entry anyway?
de: Zusätzliche Einträge in WinForms-Designer Ressourcen gehen verloren, wenn Sie das Formular bearbeiten. Wollen Sie trotzdem einen neuen Eintrag hinzufügen?

# AddKeyToolTip
source: Add new key (Shift+Insert)
de: Neuen Schlüssel hinzufügen (Umsch+Einfg)

# AddLanguageToolTip
source: Add new language
de: Neue Sprache hinzufügen

source: Authentication
de: Authentifizierung

# AutoCreateNewLanguageFiles
source: Create all resource files when adding a new resource language
de: Alle Ressourcendateien sofort erstellen, wenn eine neue Ressourcensprache hinzugefügt wird

source: Cell selection
de: Einzelne Zellen markieren

# CellSelectionToolTip
source: Allow selection of individual cells to copy/paste the content.
de: Das markieren einzelner Zellen erlauben, um deren Inhalt zu kopieren oder einzufügen.

# ChooseColumnsToolTip
source: Choose columns
de: Spalten auswählen

# CodeReferencesToolTip
source: The number of references found in code files. This is only a hint for possible usages, see documentation for more details!
de: Die Anzahl der gefundenen Code-Referenzen. Dies ist nur ein Hinweis auf die mögliche Verwendung, bitte lesen sie die Dokumentation für weitere Einzelheiten.

# CodeReferencesTooManyDetailsToolTip
source: Too many references to show details!
de: Es sind zu viele Referenzen, um Einzelheiten anzuzeigen.

# CodeReferenceTrackingInProgress
source: Code reference detection is still in progress ({0} %).
de: Code-Referenzen werden ermittelt ({0} %)

# ColumnHeaderGripperToolTip
source: +Ctrl => Apply star sizes to right columns +Shift => Extend beyond available size
de: + Strg => Rechten Spalten gleichmäßig vergrößern + Shift => Rechte Spalten nicht automatisch verkleinern

source: Comment
de: Kommentar

# CommentColumnHeader
source: Comment
de: Kommentar

source: Comment Token
de: Kommentarzeichen

# Configuration_DuplicateKeyHandling
source: Duplicate/empty resource key handling
de: Behandlung doppelter/leerer Ressourcenschlüssel

# Configuration_ExcelExportModeHeader
source: Excel export mode
de: Excel Export

# Configuration_FileCreationHeader
source: File creation
de: Dateierstellung

# Configuration_General
source: General
de: Allgemein

# Configuration_LoadSaveHeader
source: Load & Save
de: Laden & Speichern

# ConfigurationScopeHeader
source: Scope
de: Ziel

# ConfirmAddLanguage
source: Confirm adding new resource files
de: Erstellen neuer Ressourcendateien bestätigen

# ConfirmCutItems
source: Cut the selected rows?
de: Möchten sie die ausgewählten Einträge ausschneiden?

# ConfirmDeleteItems
source: Delete the selected rows?
de: Möchten sie die ausgewählten Einträge löschen?

# Copy
source: Copy (Ctrl+C)
de: Kopieren (Strg+C)

# CopyToolTip
source: Copy the selected rows or cells (Ctrl+C)
de: Markierte Zeilen oder Zellen kopieren (Strg+C)

source: Create Snapshot
de: Snapshot erzeugen

# Cut
source: Cut (Ctrl+X)
de: Ausschneiden (Strg+X)

# CutToolTip
source: Cut selected rows (Ctrl+X)
de: Markierte Zeilen ausschneiden (Strg+X)

# Delete
source: Delete (Del)
de: Löschen (Entf)

# DeleteToolTip
source: Delete selected rows (Del)
de: Markierte Einträge löschen (Entf)

# DetectCodeReferences_Header
source: Detect Code References
de: Referenzen im Quellcode erkennen

source: Diagnostics
de: Diagnose

# DonateButtonToolTip
source: Support the Open Source Community.
de: Unterstützen sie dieses Projekt mit einer kleinen Spende

# EditDefaultConfigurationNotification
source: Your are editing the default configuration. If you want to change settings that apply only to a specific solution, just open the solution.
de: Sie bearbeiten die Standardeinstellungen. Wenn sie projektmappenspezifischen Einstellungen bearbeiten möchten öffnen sie eine Projektmappe.

# EditSolutionConfigurationNotification
source: You are editing the configuration specific for the active solution. If you want to edit the default configuration, just close the solution.
de: Sie bearbeiten die projektmappenspezifischen Einstellungen. Um die Standardeinstellungen zu bearbeiten schließen sie die Projektmappe.

source: Enabled
de: Aktiv

# ErrorAddingNewResourceFile
source: Error adding the new resource file '{0}'.
de: Fehler beim Hinzufügen der neuen Ressourcedatei '{0}'

# ExportExcelAll
source: Export all
de: Alles exportieren

# ExportExcelSelection
source: Export selection
de: Auswahl exportieren

source: File Extensions
de: Dateierweiterung

# FindCodeReferencesButtonToolTip
source: Detect code references.
de: Referenzen im Quellcode erkennen.

# FlatViewToolTip
source: Flat view
de: Flache Ansicht

# GroupedViewToolTip
source: Grouped view
de: Gruppierte Ansicht

# HelpButtonToolTip
source: Documentation
de: Dokumentation

# ImportExcel
source: Import
de: Importieren

# ImportNormalizedTableExpected
source: A normalized table is expected.
de: Die Tabelle muß normalisiert sein.

# IndexColumnHeaderToolTip
source: Index of the entry in the resource file.
de: Index des Eintrags in der Ressourcendatei.

# IndexColumnToggleButtonToolTip
source: Show the index column
de: Die Indexspalte anzeigen

# IndexColumnToolTip
source: Index of the entry in the resource file. Use fractional values to reorder the entries.
de: Index des Eintrags in der Ressourcendatei. Zum umsortieren können auch Dezimalzahlen eingegeben werden.

source: Invariant
de: Nicht lokalisiert

source: Key
de: Schlüssel

# LanguageConfiguration_Description
source: This is an overview of the languages supported by the system. It shows the specific languages (e.g. 'en-US') grouped by their neutral language (e.g. 'en'). To change the flag displayed for a neutral language, double click the specific language with the desired flag.
de: Dies ist eine Übersicht über die Sprachen, die vom System unterstützt werden. Die spezifischen Sprachen (z.B. 'en-US') werden nach den neutralen Sprache (z.B. 'en') gruppiert dargestellt. Um die Flagge für eine neutrale Sprache zu ändern, doppelklicken sie auf die gewünschte spezifische Sprache.

# LikeButtonToolTip
source: Like it? Support the project by writing a short review!
de: Unterstützen sie das Projekt, indem sie ein kurzes Review schreiben!

source: Load Snapshot
de: Snapshot laden

source: Multiple selection.
de: Mehrfachauswahl.

# NeedSingleEntitySelection
source: You must select a single resource in the left side list to add entries.
de: Sie müssen eine einzelne Ressource in der linken Liste auswählen um Einträge hinzuzufügen.

# NeutralResourceLanguageHeader
source: Neutral Resources Language:
de: Standardsprache:

# NewKeyPrompt
source: Enter new resource key:
de: Geben sie einen neuen Schlüssel ein:

# NewLanguageIdPrompt
source: Select the new language:
de: Wählen sie die neue Sprache aus:

# NoCodeReferencesToolTip
source: No code references have been found by this algorithm. Nevertheless there might exist indirect references to this string.
de: Dieser Algorithmus hat keine Referenzen im Code gefunden. Es könnten aber noch indirekte Referenzen für diesen Text geben.

# NoResourceFileForResource
source: There is no resource file for this resource.
de: Es gibt keine Ressourcendatei für diese Ressource.

source: No selection.
de: Keine Auswahl.

# Paste
source: Paste (Ctrl+V)
de: Einfügen (Strg+V)

# PasteFailed
source: Error parsing the data from clipboard:
de: Fehler beim interpretieren der Daten aus der Zwischenablage:

# PasteSelectionSizeMismatch
source: The data you're pasting isn't the same size as your selection.
de: Die Daten in der Zwischenablage haben nicht die gleiche Größe wie die Auswahl.

# PasteToolTip
source: Paste the clipboard content (Ctrl+V)
de: Zwischenablage einfügen (Strg+V)

source: Patterns
de: Muster

# RefreshViewToolTip
source: Refresh view
de: Ansicht neu laden

source: Regular Expression
de: Regulärer Ausdruck

# ResourceFilterToolTip
source: A regular expression to filter resource files. The pattern will be compared against the string "{project} - {folder}\{file}", which is the same as the group header in the grouped view Use e.g. ".* - (?!Migrations)" to hide EF migrations.
de: Ein regulärer Ausdruck zum Filtern der Dateien. Die Suche wird auf den Text "{Projekt} - {Ordner}\{Datei}" angewendet. Der Text entspricht der Gruppenüberschrift in der gruppierten Ansicht. Z.B. ".* - (?!Migrations)" um EF Migrationsdateien auszublenden.

source: Save files immediately upon change
de: Dateien sofort nach Änderungen speichern

# SelectedTotalToolTip
source: Selected/Total
de: Ausgewählt/Gesamt

# ShellTabHeader_Configuration
source: Configuration
de: Konfiguration

# ShellTabHeader_Languages
source: Languages
de: Sprachen

# ShellTabHeader_Main
source: Main
de: Hauptansicht

# ShellTabHeader_Translate
source: Translate
de: Übersetzen

# ShowOnlyMissingToolTip
source: Show only lines with warnings or changes
de: Nur Zeilen anzeigen, die Warnungen oder Änderungen enthalten

# ShowPerformanceTraces
source: Show performance tracer messages in output window
de: Performance-Tracer Meldungen im Ausgabefenster anzeigen

source: Sort all files now
de: Alle Dateien jetzt sortieren

# SortBy
source: Sort using:
de: Sortieren mit:

# SortNodesByKey
source: When saving a RESX file, sort the XML data nodes by the key
de: Beim Speichern den Inhalt von RESX-Dateien nach Schlüssel sortieren

# SortNodesByKey_Confirmation
source: Do you want to sort all nodes of all resource files by the key now?
de: Möchten sie jetzt den Inhalt aller Ressourcen-Dateien nach Schlüssel sortieren?

# FileExclusionFilters_Header
source: File exclusion filter
de: Dateiausschlussfilter

# Translations_ApplyAll
source: Apply All
de: Alle anwenden

# Translations_ApplySelected
source: Apply Selected
de: Ausgewählte anwenden

# Translations_Source
source: Source:
de: Quelle:

# Translations_Targets
source: Targets:
de: Ziele:

# TranslationsPrefixHeader
source: Prefix translations with
de: Präfix vor übersetztem Text:

# TranslatorConfiguration_SaveCredentials
source: Save credentials (Credentials will be stored as clear text in your local profile!)
de: Anmeldeinformationen speichern (Anmeldeinformationen werden als Klartext in Ihrem lokalen Profil gespeichert!)

source: Unload Snapshot
de: Snapshot entladen

# WrapLongLinesToolTip
source: Wrap long lines
de: Lange Zeilen umbrechen
